In [2]:
# ANS 1:
import pandas as pd
data = [ 4, 8, 15, 16, 23,42]

In [3]:
pd.Series(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
# ANS 2:
l = [1,2,3,4,5,6,7,8,9,10]
series = pd.Series(l)

In [7]:
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [8]:
type(series)

pandas.core.series.Series

In [48]:
# ANS3 :
df = {
    "Name" : ['Alice','Bob','Claire'],
     "Age" : [25,30,27],
    "Gender":['Female' ,'Male' , 'Female']
}

In [49]:
df1 = pd.DataFrame(df)

In [50]:
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [24]:
# ANS 4 :
# "dataframe" is a data of multiple records or attributes consists of rows ans columns
# pandas series is a record of a single attribute in a dataframe
# for example
# df1 is a dataframe

In [25]:
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [26]:
# where if we print "name" then 
df1['Name']
# it is a  series

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [33]:
# ANS 5:
# dataframe.head() gives first 4 rows
# dataframe.tail() gives last 4 rows
# dataframe.columns gives cloumns names
# dataframe.isnull().sum  gives total number of null values in a column

In [34]:
df1.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [35]:
df1.tail(2)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [36]:
df1.columns

Index(['Name', 'Age', 'Gender'], dtype='object')

In [37]:
df1.isnull().sum()

Name      0
Age       0
Gender    0
dtype: int64

In [39]:
# ANS 6:
# Both series and dataframe are mutable in nature

In [41]:
# ANS 7 :
name1 = pd.Series(["chaitanya" , "sai" , "charan"])
age1 = pd.Series([23,12,15])

In [42]:
name1

0    chaitanya
1          sai
2       charan
dtype: object

In [43]:
df = pd.DataFrame({"name" : name1 , "Age" : age1})

In [44]:
df

        name  Age
0  chaitanya   23
1        sai   12
2     charan   15